function PrivacyPolicy() {
  return (
    <div className="font-noto-sans-thai-looped flex h-full w-full flex-col gap-2">
      <Header title="นโยบายความเป็นส่วนตัว" index={1} />
      <Article>
        โครงการฝึกอบรมเชิงปฏิบัติการคอมพิวเตอร์ ครั้งที่ 36
        ให้ความสําคัญกับการคุ้มครองข้อมูลส่วนบุคคลของคุณ
        โดยนโยบายความเป็นส่วนตัวฉบับนี้ได้อธิบายแนวปฏิบัติเกี่ยวกับการเก็บรวบรวม
        ใช้ หรือ เปิดเผยข้อมูลส่วนบุคคลรวมถึงสิทธิต่าง ๆ
        ของเจ้าของข้อมูลส่วนบุคคล ตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล
      </Article>
      <br />

      <Header title="การเก็บรวบรวมข้อมูลส่วนบุคคล" index={2} />
      <Article>
        เราจะเก็บข้อมูลส่วนบุคคลที่ได้รับโดยตรงจากคุณผ่านช่องทาง ดังต่อไปนี้
        <ul className="list-disc pl-5">
          <li>การรับสมัครเข้าร่วมโครงการ</li>
        </ul>
      </Article>
      <br />

      <Header title="ประเภทข้อมูลส่วนบุคคลที่เก็บรวบรวม" index={3} />
      <Article>
        <ul className="list-disc pl-5">
          <li>
            ข้อมูลส่วนบุคคล เช่น ชื่อ นามสกุล อายุ วัน/เดือน/ปีเกิด สัญชาติ
            เลขประจำตัวประชาชน เป็นต้น
          </li>
          <li>ข้อมูลการติดต่อ เช่น ที่อยู่ หมายเลขโทรศัพท์ อีเมล เป็นต้น</li>
          <li>ข้อมูลบัญชี เช่น บัญชีผู้ใช้งาน ประวัติการใช้งาน เป็นต้น</li>
          <li>
            หลักฐานแสดงตัวตน เช่น สำเนาบัตรประจำตัวประชาชน
            เอกสารรับรองการเป็นนักเรียน เป็นต้น
          </li>
          <li>
            ข้อมูลอื่น ๆ เช่น
            รูปภาพและข้อมูลอื่นใดที่ถือว่าเป็นข้อมูลส่วนบุคคลตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล
            เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลอ่อนไหว ดังต่อไปนี้
            เมื่อเราได้รับความยินยอมโดยชัดแจ้งจากคุณ เว้นแต่กฎหมายกำหนดให้ทำได้
          </li>
          <li>ข้อมูลสุขภาพ</li>
        </ul>
      </Article>
      <br />

      <Header title="ผู้เยาว์" index={4} />
      <Article>
        หากคุณมีอายุต่ำกว่า 20 ปีหรือมีข้อจํากัดความสามารถตามกฎหมาย
        เราอาจเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณ
        เราอาจจําเป็นต้องให้พ่อแม่หรือผู้ปกครองของคุณให้ความยินยอมหรือที่กฎหมายอนุญาตให้ทําได้
        หากเราทราบว่ามีการเก็บรวบรวมข้อมูลส่วนบุคคลจากผู้เยาว์โดยไม่ได้รับความยินยอมจากพ่อแม่หรือผู้ปกครอง
        เราจะดําเนินการลบข้อมูลนั้นออกจากฐานข้อมูลของเรา
      </Article>
      <br />

      <Header title="วิธีการเก็บรักษาข้อมูลส่วนบุคคล" index={5} />
      <Article>
        เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณในรูปแบบเอกสารและรูปแบบอิเล็กทรอนิกส์
      </Article>
      <br />

      <Header title="การประมวลผลข้อมูลส่วนบุคคล" index={6} />
      <Article>
        เราจะเก็บรวบรวม ใช้
        หรือเปิดเผยข้อมูลส่วนบุคคลของคุณเพื่อวัตถุประสงค์ดังต่อไปนี้
        <ul className="list-disc pl-5">
          <li>เพื่อยืนยันว่าผู้สมัครมีตัวตนจริง</li>
          <li>
            เพื่อใช้ประกอบการพิจารณาคุณสมบัติของผู้สมัครตามที่โครงการกำหนด
          </li>
          <li>เพื่อปฏิบัติตามกฎหมายและกฎระเบียบของหน่วยงานราชการ</li>
        </ul>
      </Article>
      <br />

      <Header title="การเปิดเผยข้อมูลส่วนบุคคล" index={7} />
      <Article>
        เราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณเท่าที่จำเป็นให้เจ้าหน้าที่ภายในโครงการภายใต้ความยินยอมของคุณหรือที่กฎหมายอนุญาตให้เปิดเผยได้
        เพื่อการบริหารจัดการโครงการอย่างมีประสิทธิภาพ
      </Article>
      <br />

      <Header title="ระยะเวลาจัดเก็บข้อมูลส่วนบุคคล" index={8} />
      <Article>
        เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณไว้ตามระยะเวลาที่จําเป็นสำหรับการบรรลุวัตถุประสงค์ตามนโยบายนี้
        ซึ่งอาจจําเป็นต้องเก็บรักษาไว้ต่อไปภายหลังจากนั้น
        หากมีกฎหมายกําหนดไว้เราจะลบ ทําลาย
        หรือทําให้เป็นข้อมูลที่ไม่สามารถระบุตัวตนของคุณได้
        เมื่อหมดความจําเป็นหรือสิ้นสุดระยะเวลาดังกล่าว
      </Article>
      <br />

      <Header title="สิทธิของเจ้าของข้อมูลส่วนบุคคล" index={9} />
      <Article>
        ภายใต้กฎหมายคุ้มครองข้อมูลส่วนบุคคล คุณมีสิทธิในการดำเนินการดังต่อไปนี้
        <ul className="list-disc pl-5">
          <li>
            สิทธิขอถอนความยินยอม (right to withdraw consent)
            หากคุณได้ให้ความยินยอม เราจะเก็บรวบรวม ใช้
            หรือเปิดเผยข้อมูลส่วนบุคคลของคุณ
            ไม่ว่าจะเป็นความยินยอมที่คุณให้ไว้ก่อนวันที่กฎหมายคุ้มครองข้อมูลส่วนบุคคลใช้บังคับหรือหลังจากนั้น
            คุณมีสิทธิที่จะถอนความยินยอมเมื่อใดก็ได้ตลอดเวลา
          </li>
          <li>
            สิทธิขอเข้าถึงข้อมูล (right to access)
            คุณมีสิทธิขอเข้าถึงข้อมูลส่วนบุคคลของคุณที่อยู่ในความรับผิดชอบของเราและขอให้เราทำสําเนาข้อมูลดังกล่าวให้แก่คุณ
            รวมถึงขอให้เราเปิดเผยว่าเราได้ข้อมูลส่วนบุคคลของคุณมาได้อย่างไร
          </li>
          <li>
            สิทธิขอถ่ายโอนข้อมูล (right to data portability)
            คุณมีสิทธิขอรับข้อมูลส่วนบุคคลของคุณในกรณีที่เราได้จัดทําข้อมูลส่วนบุคคลนั้นอยู่ในรูปแบบให้สามารถอ่านหรือใช้งานได้ด้วยเครื่องมือหรืออุปกรณ์ที่ทํางานได้โดยอัตโนมัติและสามารถใช้หรือเปิดเผยข้อมูลส่วนบุคคลได้ด้วยวิธีการอัตโนมัติ
            รวมทั้งมีสิทธิขอให้เราส่งหรือโอนข้อมูลส่วนบุคคลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นเมื่อสามารถทําได้ด้วยวิธีการอัตโนมัติ
            และมีสิทธิขอรับข้อมูลส่วนบุคคลที่เราส่งหรือ
            โอนข้อมูลส่วนบุคคลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นโดยตรง
            เว้นแต่ไม่สามารถดําเนินการได้เพราะเหตุทางเทคนิค
          </li>
          <li>
            สิทธิขอคัดค้าน (right to object) คุณมีสิทธิขอคัดค้านการเก็บรวบรวม
            ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณในเวลาใดก็ได้ หากการเก็บรวบรวม
            ใช้
            หรือเปิดเผยข้อมูลส่วนบุคคลของคุณที่ทําขึ้นเพื่อการดําเนินงานที่จําเป็นภายใต้ประโยชน์โดยชอบด้วยกฎหมายของเราหรือของบุคคลหรือนิติบุคคลอื่น
            โดยไม่เกินขอบเขตที่คุณสามารถคาดหมายได้อย่างสมเหตุสมผลหรือเพื่อดําเนินการตามภารกิจเพื่อสาธารณประโยชน์
          </li>
          <li>
            สิทธิขอให้ลบหรือทําลายข้อมูล (right to erasure/destruction)
            คุณมีสิทธิขอลบหรือทําลายข้อมูลส่วนบุคคลของคุณหรือทําให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวคุณได้
            หากคุณเชื่อว่าข้อมูลส่วนบุคคลของคุณถูกเก็บรวบรวม ใช้
            หรือเปิดเผยโดยไม่ชอบด้วยกฎหมายที่เกี่ยวข้องหรือเห็นว่าเราหมดความจําเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์ที่เกี่ยวข้องในนโยบายฉบับนี้หรือเมื่อคุณได้ใช้สิทธิขอถอนความยินยอมหรือใช้สิทธิขอคัดค้านตามที่แจ้งไว้ข้างต้นแล้ว
          </li>
          <li>
            สิทธิขอให้ระงับการใช้ข้อมูล (right to restriction of processing)
            คุณมีสิทธิขอให้ระงับการใช้ข้อมูลส่วนบุคคลชั่วคราวในกรณีที่เราอยู่ระหว่างตรวจสอบตามคําร้องขอใช้สิทธิขอแก้ไขข้อมูลส่วนบุคคลหรือขอคัดค้านของคุณหรือกรณีอื่นใดที่เราหมดความจําเป็นและต้องลบหรือทำลายข้อมูลส่วนบุคคลของคุณตามกฎหมายที่เกี่ยวข้องแต่คุณขอให้เราระงับการใช้แทน
          </li>
          <li>
            สิทธิขอให้แก้ไขข้อมูล (right to rectification)
            คุณมีสิทธิขอแก้ไขข้อมูลส่วนบุคคลของคุณให้ถูกต้อง เป็นปัจจุบัน
            สมบูรณ์และ ไม่ก่อให้เกิดความเข้าใจผิด
          </li>
          <li>
            สิทธิร้องเรียน (right to lodge a complaint)
            คุณมีสิทธิร้องเรียนต่อผู้มีอำนาจตามกฎหมายที่เกี่ยวข้อง
            หากคุณเชื่อว่าการเก็บรวบรวม ใช้
            หรือเปิดเผยข้อมูลส่วนบุคคลของคุณเป็นการกระทำในลักษณะที่ฝ่าฝืนหรือไม่ปฏิบัติตามกฎหมายที่เกี่ยวข้อง
          </li>
        </ul>
        คุณสามารถใช้สิทธิของคุณในฐานะเจ้าของข้อมูลส่วนบุคคลข้างต้นได้
        โดยติดต่อมาที่เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลของเราตามรายละเอียดท้ายนโยบายนี้
        เราจะแจ้งผลการดำเนินการภายในระยะเวลา 30 วัน
        นับแต่วันที่เราได้รับคำขอใช้สิทธิจากคุณ
        ตามแบบฟอร์มหรือวิธีการที่เรากำหนด ทั้งนี้
        หากเราปฏิเสธคำขอเราจะแจ้งเหตุผลของการปฏิเสธให้คุณทราบผ่านช่องทางต่าง ๆ
        เช่น อีเมล โทรศัพท์ เป็นต้น
      </Article>
      <br />

      <Header title="คุกกี้ที่เราใช้งาน" index={10} />
      <Article>
        <ul className="list-disc pl-5">
          <li>
            คุกกี้ที่มีความจำเป็นอย่างยิ่ง (Necessary Cookies)
            คุกกี้ประเภทนี้มีบทบาทสำคัญในการมอบประสบการณ์การใช้งานที่ดีที่สุดเมื่อคุณเข้าถึงและสำรวจเว็บไซต์ของเรา
            รวมถึงการใช้งานคุณสมบัติต่างๆ ตัวอย่างเช่น
            คุกกี้เหล่านี้ช่วยแจ้งให้เราทราบว่าคุณได้สร้างบัญชีและลงชื่อเข้าใช้เพื่อเข้าถึงเนื้อหา
          </li>
        </ul>
      </Article>
      <br />

      <Header
        title="การรักษาความมั่นคงและความปลอดภัยของข้อมูลส่วนบุคคล"
        index={11}
      />
      <Article>
        เราจะปกป้องข้อมูลส่วนบุคคลของคุณโดยยึดหลักการรักษาความลับ
        (confidentiality) ความถูกต้องและครบถ้วนของข้อมูล (integrity)
        และความพร้อมในการใช้งาน (availability) เพื่อป้องกันการสูญหาย
        การเข้าถึงโดยไม่ได้รับอนุญาต การใช้ เปลี่ยนแปลง แก้ไข หรือเปิดเผยข้อมูล
        นอกจากนี้ เราได้กำหนดมาตรการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล
        ซึ่งครอบคลุมมาตรการป้องกันด้านการบริหารจัดการ (administrative safeguard)
        ด้านเทคนิค (technical safeguard) และด้านกายภาพ (physical safeguard)
        รวมถึงการควบคุมการเข้าถึงและการใช้งานข้อมูลส่วนบุคคล (access control)
      </Article>
      <br />

      <Header title="การแจ้งเหตุละเมิดข้อมูลส่วนบุคคล" index={12} />
      <Article>
        ในกรณีที่มีเหตุละเมิดข้อมูลส่วนบุคคลของคุณเกิดขึ้น
        เราจะแจ้งให้สำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคลทราบโดยไม่ช้าภายใน
        72 ชั่วโมง นับแต่ทราบเหตุเท่าที่สามารถกระทำได้
        ในกรณีที่การละเมิดมีความเสี่ยงสูงที่จะมีผลกระทบต่อสิทธิและเสรีภาพของคุณ
        เราจะแจ้งการละเมิดให้คุณทราบพร้อมกับแนวทางการเยียวยาโดยไม่ชักช้าผ่านช่องทางต่าง
        ๆ เช่น เว็บไซต์ อีเมล โทรศัพท์ เป็นต้น
      </Article>
      <br />

      <Header title="รายละเอียดการติดต่อ" index={13} />
      <Article>
        หากท่านมีข้อสงสัย หรือต้องการสอบถามเกี่ยวกับ
        นโยบายและการคุ้มครองข้อมูลส่วนบุคคลของโครงการ
        หรือประสงค์จะสอบถามเกี่ยวกับ
        การใช้สิทธิของเจ้าของข้อมูลในการดำเนินการอย่างหนึ่งอย่างใดกับ
        ข้อมูลส่วนบุคคลของท่านซึ่งโครงการ ได้เก็บรวบรวมใช้
        ท่านสามารถติดต่อได้ที่เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล สถานที่ติดต่อ
        อีเมล
        <div>
          <br />
          <span className="font-bold">หัวหน้าฝ่ายทะเบียน</span>
          <br />
          นางสาวชนาภัทร มะลิเลิศ (ผักหวาน)
          <br />
          อีเมล : chanaphath.mali@mail.kmutt.ac.th
          <br />
          หมายเลขโทรศัพท์: 0957957684
        </div>
      </Article>
      <br />
    </div>
  );
}

interface HeaderProps {
  title: string;
  index: number;
}

function Header({ title, index }: HeaderProps) {
  return (
    <p className="font-bold">
      {index}. {title}
    </p>
  );
}

interface ArticleProps {
  children: React.ReactNode;
  // children: string
}

function Article({ children }: ArticleProps) {
  return <small>{children}</small>;
}

export default PrivacyPolicy;
